FKDD_COPY_DIFF_3_2026-02-13/Catalogs/ТипыЦен.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ТипыЦен</Name>
			<Comment>Типы цен</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Рассчитывается</Name>
					<Comment>Истина - цены автоматически рассчитываются (не хранятся) на основании цен базового типа</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазовыйТипЦен</Name>
					<Comment>Тип цен, от которого рассчитываются цены данного типа, если не выбран, то цены задаются вручную</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаЦены</Name>
					<Comment>Валюта цены (для цен не в валюте учета товара)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВВалютеУчета</Name>
					<Comment>Истина - вести учет в в валюте учета номенклатуры, Ложь - в валюте типа цены</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаВключаетНДС</Name>
					<Comment>Истина - цена включает НДС, ложь - цена НДС не включает</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентСкидкиНаценки</Name>
					<Comment>Процент наценки или скидки по отношению к базовому типу цен</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкруглятьВБольшуюСторону</Name>
					<Comment>Истина, то при округлении 0.01 будет округлена до 0.05, ложь - округление по арифметическим правилам</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Точность</Name>
					<Comment>Количество значащих знаков цены после запятой</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Закупка</Name>
					<Comment>Признак использования в качестве цен закупки</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Продажа</Name>
					<Comment>Признак использования в качестве цен продажи</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрироватьЦеныПоПриходу</Name>
					<Comment>Автоматически регистрировать цены по приходу</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОплаты</Name>
					<Comment>Вид оплаты</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВключатьВПрайсЛист</Name>
					<Comment>Признак отображения типа в печатной форме прайс-листа</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПолученияЦены</Name>
					<Comment>Алгоритм получения цены</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.АлгоритмПолученияЦены</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДляРабот</Name>
					<Comment>Тип цен используется для работ</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДляТоваров</Name>
					<Comment>Тип цен используется для товаров</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДляАвтомобилей</Name>
					<Comment>Тип цен используется для автомобилей</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПроцентыСкидкиНаценки</Name>
					<Comment>Проценты скидки/наценки от базового типа</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипНоменклатуры</Name>
							<Comment>Тип номенклатуры</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентСкидкиНаценки</Name>
							<Comment>Процент скидки/наценки</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/Catalogs/ТипыЦен/Ext/ManagerModule.bsl
// процедура заполнения предопределенных элементов справочника
//
// Параметры:
// ЗаполнятьВсе - Булево - Признак заполнение всей информации
//
Процедура ЗаполнитьПредопределенныеЭлементы(ЗаполнятьВсе=Ложь) Экспорт
	МенВалюты = Справочники.Валюты;
	ОснВалютаРуб = МенВалюты.НайтиПоКоду("643");
	//Заполнение основного типа цен закупки
	ТипыЦенОсновнойТипЦенЗакупки = Справочники.ТипыЦен.ОсновнойТипЦенЗакупки.ПолучитьОбъект();
	//перезаполняем реквизиты
	Если ЗаполнятьВсе Тогда
		ТипыЦенОсновнойТипЦенЗакупки.ВалютаЦены = ОснВалютаРуб;
		ТипыЦенОсновнойТипЦенЗакупки.ВидОплаты = Перечисления.ВидыОплаты.ПроизвольнаяОплата;
		ТипыЦенОсновнойТипЦенЗакупки.Закупка = Истина;
		ТипыЦенОсновнойТипЦенЗакупки.Точность = 2;
		ТипыЦенОсновнойТипЦенЗакупки.АлгоритмПолученияЦены = Перечисления.АлгоритмПолученияЦены.ПоНоменклатуре;
		ТипыЦенОсновнойТипЦенЗакупки.ДляАвтомобилей = Истина;
		ТипыЦенОсновнойТипЦенЗакупки.ДляРабот       = Истина;
		ТипыЦенОсновнойТипЦенЗакупки.ДляТоваров     = Истина;
	Иначе
		Если обЗначениеНеЗаполнено(ТипыЦенОсновнойТипЦенЗакупки.ВалютаЦены) Тогда
			ТипыЦенОсновнойТипЦенЗакупки.ВалютаЦены = ОснВалютаРуб;
		КонецЕсли;
		Если обЗначениеНеЗаполнено(ТипыЦенОсновнойТипЦенЗакупки.ВидОплаты) Тогда
			ТипыЦенОсновнойТипЦенЗакупки.ВидОплаты = Перечисления.ВидыОплаты.ПроизвольнаяОплата;
		КонецЕсли;
		Если НЕ ТипыЦенОсновнойТипЦенЗакупки.Закупка Тогда
			ТипыЦенОсновнойТипЦенЗакупки.Закупка = Истина;
		КонецЕсли;
		Если обЗначениеНеЗаполнено(ТипыЦенОсновнойТипЦенЗакупки.Точность) Тогда
			ТипыЦенОсновнойТипЦенЗакупки.Точность = 2;
		КонецЕсли;
		Если обЗначениеНеЗаполнено(ТипыЦенОсновнойТипЦенЗакупки.АлгоритмПолученияЦены) Тогда
			ТипыЦенОсновнойТипЦенЗакупки.АлгоритмПолученияЦены = Перечисления.АлгоритмПолученияЦены.ПоНоменклатуре;
		КонецЕсли;
		Если НЕ ТипыЦенОсновнойТипЦенЗакупки.ДляАвтомобилей Тогда
			ТипыЦенОсновнойТипЦенЗакупки.ДляАвтомобилей = Истина;
		КонецЕсли;
		Если НЕ ТипыЦенОсновнойТипЦенЗакупки.ДляРабот Тогда
			ТипыЦенОсновнойТипЦенЗакупки.ДляРабот = Истина;
		КонецЕсли;
		Если НЕ ТипыЦенОсновнойТипЦенЗакупки.ДляТоваров Тогда
			ТипыЦенОсновнойТипЦенЗакупки.ДляТоваров = Истина;
		КонецЕсли;
	КонецЕсли;
	НовыйЭлемент = ТипыЦенОсновнойТипЦенЗакупки.ЭтоНовый();
	Если ТипыЦенОсновнойТипЦенЗакупки.Модифицированность() Тогда
		Попытка
			ТипыЦенОсновнойТипЦенЗакупки.Записать();
			Сообщить("Справочник ""Типы цен"". "+?(НовыйЭлемент,"Создан","Обновлен")+" элемент """+СокрЛП(ТипыЦенОсновнойТипЦенЗакупки.Наименование)+"""");
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	//Заполнение основного типа цен продажи
	ТипыЦенОсновнойТипЦенПродажи = Справочники.ТипыЦен.ОсновнойТипЦенПродажи.ПолучитьОбъект();
	//перезаполняем реквизиты
	Если ЗаполнятьВсе Тогда
		ТипыЦенОсновнойТипЦенПродажи.ВалютаЦены = ОснВалютаРуб;
		ТипыЦенОсновнойТипЦенПродажи.Продажа = Ложь;
		ТипыЦенОсновнойТипЦенПродажи.Точность = 2;
		ТипыЦенОсновнойТипЦенПродажи.ВидОплаты = Перечисления.ВидыОплаты.ПроизвольнаяОплата;
		ТипыЦенОсновнойТипЦенПродажи.АлгоритмПолученияЦены = Перечисления.АлгоритмПолученияЦены.ПоНоменклатуре;
		ТипыЦенОсновнойТипЦенПродажи.ДляАвтомобилей = Истина;
		ТипыЦенОсновнойТипЦенПродажи.ДляРабот       = Истина;
		ТипыЦенОсновнойТипЦенПродажи.ДляТоваров     = Истина;
	Иначе
		Если обЗначениеНеЗаполнено(ТипыЦенОсновнойТипЦенПродажи.ВалютаЦены) Тогда
			ТипыЦенОсновнойТипЦенПродажи.ВалютаЦены = ОснВалютаРуб;
		КонецЕсли;
		Если НЕ ТипыЦенОсновнойТипЦенПродажи.Продажа Тогда
			ТипыЦенОсновнойТипЦенПродажи.Продажа = Истина;
		КонецЕсли;
		Если обЗначениеНеЗаполнено(ТипыЦенОсновнойТипЦенПродажи.Точность) Тогда
			ТипыЦенОсновнойТипЦенПродажи.Точность = 2;
		КонецЕсли;
		Если обЗначениеНеЗаполнено(ТипыЦенОсновнойТипЦенПродажи.ВидОплаты) Тогда
			ТипыЦенОсновнойТипЦенПродажи.ВидОплаты = Перечисления.ВидыОплаты.ПроизвольнаяОплата;
		КонецЕсли;
		Если обЗначениеНеЗаполнено(ТипыЦенОсновнойТипЦенПродажи.АлгоритмПолученияЦены) Тогда
			ТипыЦенОсновнойТипЦенПродажи.АлгоритмПолученияЦены = Перечисления.АлгоритмПолученияЦены.ПоНоменклатуре;
		КонецЕсли;
		Если НЕ ТипыЦенОсновнойТипЦенПродажи.ДляАвтомобилей Тогда
			ТипыЦенОсновнойТипЦенПродажи.ДляАвтомобилей = Истина;
		КонецЕсли;
		Если НЕ ТипыЦенОсновнойТипЦенПродажи.ДляРабот Тогда
			ТипыЦенОсновнойТипЦенПродажи.ДляРабот = Истина;
		КонецЕсли;
		Если НЕ ТипыЦенОсновнойТипЦенПродажи.ДляТоваров Тогда
			ТипыЦенОсновнойТипЦенПродажи.ДляТоваров = Истина;
		КонецЕсли;
	КонецЕсли;
	//Сохранение справочника
	НовыйЭлемент = ТипыЦенОсновнойТипЦенПродажи.ЭтоНовый();
	Если ТипыЦенОсновнойТипЦенПродажи.Модифицированность() Тогда
		Попытка		
			ТипыЦенОсновнойТипЦенПродажи.Записать();
			Сообщить("Справочник ""Типы цен"". "+?(НовыйЭлемент,"Создан","Обновлен")+" элемент """+СокрЛП(ТипыЦенОсновнойТипЦенПродажи.Наименование)+"""");
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	//Заполнение нормативного типа цен
	ТипыЦенНормативнаяЦена = Справочники.ТипыЦен.НормативнаяЦена.ПолучитьОбъект();
	//перезаполняем реквизиты
	Если ЗаполнятьВсе Тогда
		ТипыЦенНормативнаяЦена.ВалютаЦены = ОснВалютаРуб;
		ТипыЦенНормативнаяЦена.ВидОплаты = Перечисления.ВидыОплаты.ПроизвольнаяОплата;
		ТипыЦенНормативнаяЦена.Закупка = Истина;
		ТипыЦенНормативнаяЦена.Точность = 2;
		ТипыЦенНормативнаяЦена.АлгоритмПолученияЦены = Перечисления.АлгоритмПолученияЦены.ПоНоменклатуре;
		ТипыЦенНормативнаяЦена.ДляАвтомобилей = Истина;
		ТипыЦенНормативнаяЦена.ДляРабот       = Истина;
		ТипыЦенНормативнаяЦена.ДляТоваров     = Истина;
	Иначе
		Если обЗначениеНеЗаполнено(ТипыЦенНормативнаяЦена.ВалютаЦены) Тогда
			ТипыЦенНормативнаяЦена.ВалютаЦены = ОснВалютаРуб;
		КонецЕсли;
		Если обЗначениеНеЗаполнено(ТипыЦенНормативнаяЦена.ВидОплаты) Тогда
			ТипыЦенНормативнаяЦена.ВидОплаты = Перечисления.ВидыОплаты.ПроизвольнаяОплата;
		КонецЕсли;
		Если НЕ ТипыЦенНормативнаяЦена.Закупка Тогда
			ТипыЦенНормативнаяЦена.Закупка = Истина;
		КонецЕсли;
		Если обЗначениеНеЗаполнено(ТипыЦенНормативнаяЦена.Точность) Тогда
			ТипыЦенНормативнаяЦена.Точность = 2;
		КонецЕсли;
		Если обЗначениеНеЗаполнено(ТипыЦенНормативнаяЦена.АлгоритмПолученияЦены) Тогда
			ТипыЦенНормативнаяЦена.АлгоритмПолученияЦены = Перечисления.АлгоритмПолученияЦены.ПоНоменклатуре;
		КонецЕсли;
		Если НЕ ТипыЦенНормативнаяЦена.ДляАвтомобилей Тогда
			ТипыЦенНормативнаяЦена.ДляАвтомобилей = Истина;
		КонецЕсли;
		Если НЕ ТипыЦенНормативнаяЦена.ДляРабот Тогда
			ТипыЦенНормативнаяЦена.ДляРабот = Истина;
		КонецЕсли;
		Если НЕ ТипыЦенНормативнаяЦена.ДляТоваров Тогда
			ТипыЦенНормативнаяЦена.ДляТоваров = Истина;
		КонецЕсли;
	КонецЕсли;
	НовыйЭлемент = ТипыЦенНормативнаяЦена.ЭтоНовый();
	Если ТипыЦенНормативнаяЦена.Модифицированность() Тогда
		Попытка
			ТипыЦенНормативнаяЦена.Записать();
			Сообщить("Справочник ""Типы цен"". "+?(НовыйЭлемент,"Создан","Обновлен")+" элемент """+СокрЛП(ТипыЦенНормативнаяЦена.Наименование)+"""");
		Исключение
		КонецПопытки;
	КонецЕсли;
КонецПроцедуры // ЗаполнитьПредопределенныеЭлементы()
